Repository: Phil-naz/djsite
Catalog: coolsite/locale/*/LC_MESSAGES/django.po
Languages: ru

source: Add a book
ru: Добавить книгу

source: All books
ru: Все книги

source: This app is under construction. Nowadays, you can add here books with description of author. Later, users can add their descriptions and add quotes from them.
ru: Это приложение находится в стадии разработки. В настоящее время вы можете добавлять сюда книги с описанием автора. Позже пользователи смогут добавлять свои описания и цитаты из них.

source: Description and Quotes
ru: Описание и цитаты

source: Comparison last body measurements with
ru: Сравнение последних замеров тела с замерами от

source: Date
ru: Дата

source: Shoulders
ru: Плечи

source: Chest
ru: Грудь

source: Waist
ru: Талия

source: Buttocks
ru: Ягодицы

source: Hips
ru: Бёдра

source: Weight
ru: Вес

source: Difference
ru: Разница

source: Log in
ru: Войти

source: , if necessary
ru: , при необходимости

source: register
ru: зарегистрируйтесь

source: , your body measurement history will be displayed here.
ru: , здесь будет отображаться история замеров тела

source: Comparison last with measurements from
ru: Сравнение последних замеров тела с замерами от

source: Add measurements
ru: Добавить замеры тела

source: Red digits near fields is your last data
ru: Красные цифры рядом с полями - это ваши последние данные

source: 1. SHOULDERS
ru: 1. ПЛЕЧИ

source: (by the largest place, scar or mole)
ru: (по самому большому месту, шраму или родинке)

source: 2. CHEST
ru: 2. ГРУДЬ

source: (on the nipples)
ru: (по соскам)

source: 3. WAIST
ru: 3. ТАЛИЯ

source: (along the lower edge)
ru: (по нижнему ребру)

source: 4. BUTTOCKS
ru: 4. ЯГОДИЦЫ

source: 5. HIPS
ru: 5. БЕДРА

source: (left and right - by the largest place, scar or mole)
ru: (левое и правое - по самому большому месту, шраму или родинке)

source: WEIGHT
ru: ВЕС

source: Add
ru: Добавить

source: Body measurements
ru: Замеры тела

source: keep a history of body measurements and compare it with the previous date.
ru: сохраняйте историю замеров тела и сравнивайте ее с замерами предыдущей даты.

source: , and you can save body measurements and compare with past data.
ru: , вы можете сохранить измерения тела и сравнить с прошлыми данными.

source: History of body measurements
ru: История замеров тела

source: Registration
ru: Регистрация

source: Philip Nazarenko: the web-page about me & my web-projects.
ru: Филипп Назаренко: веб-страница обо мне и моих веб-проектах.

source: Development of web projects using the Django framework (Python)
ru: Разработка веб-проектов с использованием фреймворка Django (Python)

source: Analytics (using Excel, SQL, Python)
ru: Аналитика (с использованием Excel, SQL, Python)

source: Information about me (summary):
ru: Информация обо мне (кратко):

source: planning: I usually plan everything in my life. There is a plan for the long-term perspective (from 3 years), medium-term (1-3 years). In my current life I use a plan for a week (sprint), every day I use
ru: планирование: обычно планирую все в своей жизни. Есть план на долгосрочную перспективу (от 3х лет), среднесрочную (1-3г ода). В текущей жизни использую план на неделю (спринт), каждый день использую

source: "Todoist" Task Manager
ru: менеджер задач «Todoist»

source: I think it`s impossible to know everything, teamwork is important - each member of the team will specialize in a certain part of the work;
ru: считаю, что все знать невозможно, важна командная работа - каждый участник команды будет специализироваться на определенной части работы;

source: all the money that passes my hands (accounts) must be recorded. For current income and expenses I use
ru: все деньги, которые проходят мои руки (счета) обязательно записаны. Для текущих доходов и расходов использую

source: app. DREBEDENGI
ru: приложение «Drebedengi»

source: in order not to constantly look for instructions on how to do something specific, I take notes (write it down for myself) of the actions.
ru: чтобы постоянно не искать инструкцию как сделать что-то определенное, я записываю это для себя, то есть конспектирую действия.

source: Example of notes on the DJANGO framework
ru: Пример конспекта по вреймворку «DJANGO»

source: I think that there is never much knowledge and you always need to learn! I passed trainings: "Personnel Management", "Art of sales", "Context", "Money", "PYTHON for analysts" and many others;
ru: считаю, что знаний много не бывает и учиться нужно всегда! Проходил обучения: «Управление персоналом», «Искусство продаж», «Контекст», «Деньги», «PYTHON для аналитиков»;

source: you learn by doing (usually I learn by practice);
ru: делая обучаешься (обычно обучаюсь на практике);

source: you can find (almost) any information on the Internet;
ru: в интернете можно найти (практически) любую информацию;

source: according to the SCRUM methodology, I am a "Wise fool": this is a person who asks unpleasantquestions or speaks an inconvenient truth to his face. Few people perform this role, although it is necessary in SCRUM teams;
ru: по методологии SCRUM я - «Мудрый шут»: это человек, задающий неприятные вопросы или говорящий в лицо неудобную правду. Мало, кто выполняет эту роль, хотя она необходима в SCRUM-командах;

source: I like to read. By
ru: люблю читать. По

source: the link
ru: ссылке

source: that`s not all I`ve read. But the principle of choosing books and the subject are clear;
ru: не все, что я прочел. Но принцип выбора книг и тематика понятны;

source: I choose not to smoke;
ru: я выбираю не курить;

source: I choose not to drink any alcohol
ru: не употреблять напитки, содержащие алкоголь.

source: My habits:
ru: Мои привычки:

source: A habbit
ru: Привычка

source: an automatically reproducible action, the execution of which is initiated by some signal (habit trigger) and is performed and completed with a sense of pleasure. The established way of behavior, the implementation of which in a certain situation (playing the role of a trigger, a signal that triggers the actions of a habit) acquires for the individual the character of a need that prompts "to perform some actions, deeds". When forming a habit, an action is repeatedly performed, a pleasant emotional experience caused by the very implementation of this action is extremely important, since it is "learned ..., which has become automatic and is performed without effort."
ru: — автоматически воспроизводимое действие, исполнение которого инициируется некоторым сигналом (триггером привычки) и выполняется и завершается с чувством удовольствия. Сложившийся способ поведения, осуществление которого в определённой ситуации (играющей роль триггера, сигнала, запускающего действия привычки) приобретает для индивида характер потребности, побуждающей «совершать какие-нибудь действия, поступки». При формировании привычки неоднократно выполняется какое-либо действие, чрезвычайно важное значение имеет вызываемое самим осуществлением этого действия приятное эмоциональное переживание, так как оно является «усвоенным…, которое стало автоматическим и совершается без усилий».

source: Wikipedia
ru: Википедия

source: I read books (at least 1 hour a day). I like to read business literature. In this
ru: Читаю книги (минимум 1 час в день). Люблю читать деловую- и бизнес-литературу. В этом

source: list
ru: списке

source: not everything Ive read. But the principle of choice and the subject are clear.
ru: не все, что я прочел. Но принцип выбора и тематика понятны.

source: I choose to keep my word and put all available efforts and opportunities, so that everything comes true as I promised. If I`m not sure about anything, I`d rather keep silent. An excellent video by Vladimir Gerasichev, which describes the approach that I adhere to:
ru: Я выбираю «держать слово» и прикладывать все доступные усилия и возможности, чтобы все сбывалось так, как я пообещал. Если в чем-либо неуверен, я лучше промолчу. Отличное видео Владимира Герасичева, где описан подход, которого я придерживаюсь:

source: I choose to make a promise, keep my word, usually everything I choose to do, I do with a good mood.
ru: Я выбираю давать обещание, «держать слово», обычно все что выбираю делать, я делаю с хорошим настроем.

source: Full interview.
ru: Интервью полностью.

source: I am learning English:
ru: Изучаю английский язык:

source: I use the Duolingo app for classes every day (at least 30 minutes);
ru: ежедневно использую для занятий приложение «Duolingo» (минимум 30 минут);

source: periodically I watch movies in English.
ru: периодически смотрю фильмы на английском языке.

source: Sports and physical activity:
ru: Занятие спортом и физическая активность:

source: I do sports every day (at first I did regular exercises, but on October 05, 2022 I reached 500 daily squats, it`s hard to call it "Regular exercises");
ru: ежедневно занимаюсь спортом (сначала делал зарядку обычную, но 05 октября 2022г. дошел до 500 приседаний ежедневных, это уже сложно назвать «обычной зарядкой»);

source: I walk at least 7000 steps a day (usually more);
ru: прохожу не менее 7000 шагов в день (обычно больше);

source: I go skiing.
ru: катаюсь на горных лыжах.

source: Hardening. I started in winter by dipping into a pond (ice hole) after a steam room, now in the shower at the end I stand for a minute under freezing water.
ru: Закаливание. Начал зимой окунанием в водоем (прорубь) после парилки, сейчас в душе в завершение стою минуту под исключительно холодной водой.

source: Usually, the first associations with the word "habit" are: a bad habit and smoking. I choose:
ru: Обычно, первые ассоциации со словом "привычка" это: вредная привычка и курение. Я выбираю:

source: not to smoke;
ru: не курить;

source: not to drink any alcohol
ru: не употреблять напитки, содержащие алкоголь.

source: I like decision-making based on numbers (facts). I visualize data based on numbers beautifully and clearly (graphs, tables, etc.)
ru: Люблю принятие решений, основанное на цифрах (фактах). Данные, основанные на цифрах, красиво и понятно визуализирую (графики, таблицы и пр.)

source: I use Excel & GoogleSheets;
ru: владею Excel & GoogleSheets;

source: I use Git & GitHub;
ru: владею Git & GitHub;

source: I use MySQL, SQLite, PostgreSQL;
ru: владею MySQL, SQLite, PostgreSQL;

source: Django framework;
ru: фреймворк Django;

source: The system I created on Excel (Google Sheets):
ru: Система, созданная мною на Excel (Google Sheets):

source: Advantages of Excel (Google Sheets):
ru: Преимущества Excel (Google Sheets):

source: Everything can be counted (taken into account) and saved;
ru: Все можно считать (учитывать) и сохранять;

source: Based on the saved data, it is possible to plan expenses and receipts in the future;
ru: На основе сохранённых данных можно планировать расходы и поступления в будущем;

source: You can set up remote transmission of information. Only the Internet is needed. You will always have access, even if you go somewhere. Access is possible even from a mobile phone;
ru: Можно настроить удаленную передачу информации. Нужен только интернет. У вас будет доступ всегда, даже если куда-нибудь уедете. Доступ возможен даже с мобильного телефона;

source: Everything can be viewed from any modern smartphone. You don`t need a computer. Only a user skill is needed to configure the display, there is no need to involve a programmer (or a system administrator);
ru: Все можно посмотреть с любого современного смартфона. Компьютер не нужен. Для настройки отображения нужен только пользовательский навык, не нужно привлекать системного администратора;

source: The ability to customize the report view that is convenient for you. Emphasize important data, remove unnecessary;
ru: Возможность настроить удобный вам вид отчета. Акцентировать важные данные, убрать ненужные;

source: There are quite a lot of Excel specialists. Without problems, you can find an alternative specialist, unlike special programs.
ru: Специалистов Excel довольно много. Без проблем можно найти альтернативного специалиста, в отличие от специальных программ (даже для распространенной 1С труднее).

source: Download:
ru: Скачать:

source: Larger diagram (png file);
ru: Схема крупнее (png файл);

source: Summary table (GSheets file);
ru: Сводная таблица (GSheets файл);

source: Point of sale accounting file (Excel file).
ru: Файл учета торговых точек (Excel файл).

source: Analytics. We take into account the ratio to the last month and to the average value for the year:
ru: Аналитика. Учитываем отношение к прошлому месяцу и к среднему значению за год:

source: "Little one" of formula. There are many such formulas out there:
ru: "Формулка". Одна из. Таких формул обычно много...

source: Practice:
ru: Практика:

source: I passed
ru: Прошел

source: created a training project "Django To Do List App With User Registration & Login"
ru: создал учебный проект «Django To Do List App With User Registration & Login»

source: In the project:
ru: В проекте:

source: creating a task manager;
ru: создание менеджера задач;

source: user registration & login;
ru: регистрация и авторизация пользователей;

source: DELETE functionality;
ru: функция удаления

source: search function;
ru: функция поиска

source: course John Elder
ru: John Elder course

source: created a training project "Create A Simple Blog With Python and Django"
ru: создал учебный проект «Create A Simple Blog With Python and Django»

source: creating a blog;
ru: создание блога;

source: ability to create categories and assign a category to blog posts;
ru: возможность создания категорий и присвоение категории записям блога;

source: creating SLUG addresses to categories;
ru: создание SLUG адресов к категориям постов;

source: system of
ru: создание системы

source: Registration
ru: регистрации

source: and
ru: и

source: authorizations
ru: авторизации

source: users;
ru: пользователей;

source: adding posts to a website with a photo. There is also the possibility of formatting the text of the post.
ru: добавление постов на сайт с фотографией. Также есть возможность форматирования текста поста.

source: It is possible to make only registered and authorized users;
ru: Возможно только зарегистрированным и авторизованным пользователям;

source: the ability to edit and delete posts to certain users;
ru: возможность редактирования и удаления постов определенным пользователям;

source: creating a system of likes;
ru: создание системы лайков;

source: creating a post comment system;
ru: создание системы комментариев поста;

source: Selfedu training
ru: обучение Selfedu

source: created a training project "Women"
ru: создал учебный проект «Women»

source: selection of articles with a photo;
ru: подбор статей с фотографией;

source: articles are divided into categories, you can choose to display articles by certain category;
ru: статьи разделены на категории, можно выбрать отображение статей по определенным категориям;

source: adding articles to a website with a photo.
ru: добавление статей на сайт с фотографией.

source: It is possible to do this only for registered and authorized users;
ru: Возможно сделать только зарегистрированным и авторизованным пользователям;

source: SLUGs are used for routing to articles;
ru: для маршрутизации к статьям используются слаги (SLUG);

source: using MIXINs to remove code duplication;
ru: использование MIXINs для того, чтобы убрать дублирование кода;

source: using paginated navigation (pagination);
ru: использование постраничной навигации (пагинация);

source: Additionally:
ru: Дополнительно:

source: this site is completely made on the Django framework: here I create and upload projects (including educational ones). The source code of this project can be viewed at
ru: данный сайт полностью сделан на фреймворке Django: здесь создаю и выкладываю проекты (в том числе и учебные). Исходный код данного проекта можно посмотреть на

source: this site is made multilingual
ru: этот сайт сделан мультиязычным

source: I created an application in which it possible to save, compare with last date and watch the dynamics of body measurements;
ru: создал приложение, в котором можно сохранять и смотреть динамику своих замеров тела;

source: I am creating an application with a list of books I have read, in which you can write your description of the book and add quotes from the book;
ru: создаю приложение со списком прочитанных книг, в котором можно будет писать свое описание книги и добавлять цитаты из книги;

source: My HARD & SOFT Skills
ru: Мои HARD & SOFT скилы

source: Books and Quotes
ru: Книги и цитаты

source: Log out
ru: Выйти

source: y.
ru: г.

source: Copyright. All Rights Reserved.
ru: Частичное или полное копирование информации с данного сайта для распространения на других ресурсах, в том числе и бумажных, без разрешения запрещено.

source: SORRY, FAIL
ru: ИЗВИНИТЕ, ОШИБКА

source: Unfortunately, registration is not working right now :(
ru: К сожалению, регистрация сейчас не работает:(

source: For using functionality of this web project, you can use
ru: Для использования функционала этого веб-проекта вы можете использовать

source: You can write any questions to email:
ru: Вы можете написать любые вопросы по электронной почте:

source: Authorization
ru: Авторизация

source: Enter an email and password.
ru: Введите email и парольь
